<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5820ddfd2e45136f09d59ed32e1288b28e660e0fae94cde20bd8e8816e6d698b","plan_job_ref":"Job Run Terraform plan in staging #5 at https://github.com/zjrgov/my-rails-app/actions/runs/12717016089","plan_out_hash":"2e4ebac21c6948184d2f14ca86db221bc70eef1d47166e10d54ff3a44777e58f","plan_hash":"7fd77c7e4fb5f7469e50348e85a11f8b0ae27fc141533e57f6f6aeab3c1583da","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-01-10T20:43:36Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "my_rails_app-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "JNNCnIzfrxfWnMnSkqDhdynoQTDEp6jXP5cYlh0Pcks=" -> "bGW45A/Qi2Nu1BDtzdAq89cvwkzpemxeMR7etGz6ACc="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-10T20:45:40Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #5](https://github.com/zjrgov/my-rails-app/actions/runs/12717016089)